{"storymap": {"attribution": "Google Hybrid (https://hatarilabs.com/ih-en/how-to-add-a-google-map-in-qgis-3-tutorial)", "call_to_action": true, "call_to_action_text": "", "map_as_image": false, "map_subdomains": "", "map_type": "http://mt0.google.com/vt/lyrs=y&hl=en&x={x}&y={y}&z={z}", "slides": [{"date": "", "location": {"line": true}, "media": {"caption": "", "credit": "", "url": ""}, "text": {"headline": "Elijah & Elisha", "text": "Storymap of Elijah and Elisha, the 9th century BC prophets of God.<br><br>Map zoom controls:<br>\n1. Double click to zoom in.<br>\n2. Shift + double click to zoom out.<br>\n3. Pinch in/out for touchscreen.<br>\n<br>\n<img alt=\"\" src=\"https://worldenglish.bible/weblogo.jpg\" style=\"width:25px;height:19px;\">&nbsp;The <a href=\"https://worldenglish.bible/\" target=\"_blank\" rel=\"\">World English Bible</a> (WEB) is a Public Domain (no copyright) Modern English translation of the Holy Bible.<br>\n<br>\nLocations were obtained from <a href=\"https://www.openbible.info/geo/\" target=\"_blank\">Bible Geocoding</a>.<br>"}, "type": "overview"}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/04_FB_ISC_Men_1_1024.png", "iconSize": [43.152875175315565, 48], "lat": 32.3658, "line": true, "lon": 35.718, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Elijah battling the priests of Baal - statue at the Carmelite Monastery on Mount Carmel, Israel.\"", "credit": "Photo by Steve Nimmons | Author is licensed under CC BY-NC 2.0.", "url": "https://live.staticflickr.com/65535/48807200141_941918771e_b.jpg"}, "text": {"headline": "Elijah the tishbite", "text": "<span>Tishbe (birthplace of Elijah)<br><br><b>1 Kings 17:1</b><br>1 Elijah the Tishbite, who was one of the settlers of Gilead, said to Ahab, “As Yahweh, the God of Israel, lives, before whom I stand, there shall not be dew nor rain these years, but according to my word.”</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/04_FB_ISC_Men_1_1024.png", "iconSize": [43.152875175315565, 48], "lat": 32.394722, "line": true, "lon": 35.591389, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "", "credit": "©️ Kumudan Grubh", "url": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/media-1655703715232-Jun_20_2022_12_41_AM.jpg"}, "text": {"headline": "Brook Cherith", "text": "<span>Cherith (8 miles from Tishbe)<br><br><b>1 Kings 17:2-6</b><br>2 Then Yahweh’s word came to him, saying, 3 “Go away from here, turn eastward, and hide yourself by the brook Cherith, that is before the Jordan. 4 You shall drink from the brook. I have commanded the ravens to feed you there.” 5 So he went and did according to Yahweh’s word; for he went and lived by the brook Cherith that is before the Jordan. 6 The ravens brought him bread and meat in the morning, and bread and meat in the evening; and he drank from the brook. 7 After a while, the brook dried up, because there was no rain in the land.</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/04_FB_ISC_Men_1_1024.png", "iconSize": [43.152875175315565, 48], "lat": 33.464227, "line": true, "lon": 35.295136, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Elijah_Widow/overview-images/016-elijah-widow.jpg?1639569397"}, "text": {"headline": "Miracles at the Widow's", "text": "<span>Zarephath (76 miles from Cherith)<br><br><b>1 Kings 17:8-24</b><br>8 Yahweh’s word came to him, saying, 9 “Arise, go to Zarephath, which belongs to Sidon, and stay there. Behold, I have commanded a widow there to sustain you.”<br><br>10 So he arose and went to Zarephath; and when he came to the gate of the city, behold, a widow was there gathering sticks. He called to her, and said, “Please get me a little water in a jar, that I may drink.”<br><br>11 As she was going to get it, he called to her, and said, “Please bring me a morsel of bread in your hand.”<br><br>12 She said, “As Yahweh your God lives, I don’t have a cake, but a handful of meal in a jar, and a little oil in a jar. Behold, I am gathering two sticks, that I may go in and bake it for me and my son, that we may eat it, and die.”<br><br>13 Elijah said to her, “Don’t be afraid. Go and do as you have said; but make me a little cake from it first, and bring it out to me, and afterward make some for you and for your son. 14 For Yahweh, the God of Israel says, ‘The jar of meal will not run out, and the jar of oil will not fail, until the day that Yahweh sends rain on the earth.’”<br><br>15 She went and did according to the saying of Elijah; and she, and he, and her house, ate many days. 16 The jar of meal didn’t run out, and the jar of oil didn’t fail, according to Yahweh’s word, which he spoke by Elijah. 17 After these things, the son of the woman, the mistress of the house, became sick; and his sickness was so severe that there was no breath left in him. 18 She said to Elijah, “What have I to do with you, you man of God? You have come to me to bring my sin to memory, and to kill my son!”<br><br>19 He said to her, “Give me your son.” He took him out of her bosom, and carried him up into the room where he stayed, and laid him on his own bed. 20 He cried to Yahweh, and said, “Yahweh my God, have you also brought evil on the widow with whom I am staying, by killing her son?”<br><br>21 He stretched himself on the child three times, and cried to Yahweh, and said, “Yahweh my God, please let this child’s soul come into him again.”<br><br>22 Yahweh listened to the voice of Elijah; and the soul of the child came into him again, and he revived. 23 Elijah took the child, and brought him down out of the room into the house, and delivered him to his mother; and Elijah said, “Behold, your son lives.”<br><br>24 The woman said to Elijah, “Now I know that you are a man of God, and that Yahweh’s word in your mouth is truth.”</span><br>"}}, {"date": "", "location": {"lat": 32.276111, "line": true, "lon": 35.195, "zoom": 12, "use_custom_marker": true, "icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/02_FB_ISC_Kings_Queens_1024.png", "iconSize": [27.900439238653, 48]}, "media": {"caption": "\"King Ahab not only turned away from God to worship Baal, but encouraged the whole nation to do the same.\"", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Elijah_Prophets_Baal/overview-images/002-elijah-prophets-baal.jpg?1643121023"}, "text": {"headline": "After three years of drought..", "text": "<span>Samaria (82 miles from Zarephath)<br><br><b>1 Kings 18:1-18</b><br>After many days, Yahweh’s word came to Elijah, in the third year, saying, “Go, show yourself to Ahab; and I will send rain on the earth.”<br><br>2 Elijah went to show himself to Ahab. The famine was severe in Samaria. 3 Ahab called Obadiah, who was over the household. (Now Obadiah feared Yahweh greatly; 4 for when Jezebel cut off Yahweh’s prophets, Obadiah took one hundred prophets, and hid them fifty to a cave, and fed them with bread and water.) 5 Ahab said to Obadiah, “Go through the land, to all the springs of water, and to all the brooks. Perhaps we may find grass and save the horses and mules alive, that we not lose all the animals.”<br><br>6 So they divided the land between them to pass throughout it. Ahab went one way by himself, and Obadiah went another way by himself. 7 As Obadiah was on the way, behold, Elijah met him. He recognized him, and fell on his face, and said, “Is it you, my lord Elijah?”<br><br>8 He answered him, “It is I. Go, tell your lord, ‘Behold, Elijah is here!’”<br><br>9 He said, “How have I sinned, that you would deliver your servant into the hand of Ahab, to kill me? 10 As Yahweh your God lives, there is no nation or kingdom where my lord has not sent to seek you. When they said, ‘He is not here,’ he took an oath of the kingdom and nation, that they didn’t find you. 11 Now you say, ‘Go, tell your lord, “Behold, Elijah is here.”’ 12 It will happen, as soon as I leave you, that Yahweh’s Spirit will carry you I don’t know where; and so when I come and tell Ahab, and he can’t find you, he will kill me. But I, your servant, have feared Yahweh from my youth. 13 Wasn’t it told my lord what I did when Jezebel killed Yahweh’s prophets, how I hid one hundred men of Yahweh’s prophets with fifty to a cave, and fed them with bread and water? 14 Now you say, ‘Go, tell your lord, “Behold, Elijah is here”.’ He will kill me.”<br><br>15 Elijah said, “As Yahweh of Armies lives, before whom I stand, I will surely show myself to him today.” 16 So Obadiah went to meet Ahab, and told him; and Ahab went to meet Elijah. 17 When Ahab saw Elijah, Ahab said to him, “Is that you, you troubler of Israel?”<br><br>18 He answered, “I have not troubled Israel; but you, and your father’s house, in that you have forsaken Yahweh’s commandments, and you have followed the Baals.</span><br>"}}, {"date": "", "location": {"lat": 32.6725, "line": true, "lon": 35.023333, "zoom": 12, "use_custom_marker": true, "icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/08_FB_ISC_Buildings_1024.png", "iconSize": [35.22206896551724, 48]}, "media": {"caption": "\"The people fell on their faces and exclaimed, ‘The Lord, He is God! The Lord, He is God!’ The whole nation worshipped the Lord as the only living God.\"", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Elijah_Prophets_Baal/overview-images/042-elijah-prophets-baal.jpg?1643121026"}, "text": {"headline": "Mount Carmel showdown", "text": "<span>Mount Carmel (29 miles from Samaria)<br><br><b>1 Kings 18:19-44</b><br>19 Now therefore send, and gather to me all Israel to Mount Carmel, and four hundred fifty of the prophets of Baal, and four hundred of the prophets of the Asherah, who eat at Jezebel’s table.”<br><br>20 So Ahab sent to all the children of Israel, and gathered the prophets together to Mount Carmel. 21 Elijah came near to all the people, and said, “How long will you waver between the two sides? If Yahweh is God, follow him; but if Baal, then follow him.”<br><br>The people didn’t say a word.<br><br>22 Then Elijah said to the people, “I, even I only, am left as a prophet of Yahweh; but Baal’s prophets are four hundred fifty men. 23 Let them therefore give us two bulls; and let them choose one bull for themselves, and cut it in pieces, and lay it on the wood, and put no fire under; and I will dress the other bull, and lay it on the wood, and put no fire under it. 24 You call on the name of your god, and I will call on Yahweh’s name. The God who answers by fire, let him be God.”<br><br>All the people answered, “What you say is good.”<br><br>25 Elijah said to the prophets of Baal, “Choose one bull for yourselves, and dress it first; for you are many; and call on the name of your god, but put no fire under it.”<br><br>26 They took the bull which was given them, and they dressed it, and called on the name of Baal from morning even until noon, saying, “Baal, hear us!” But there was no voice, and nobody answered. They leaped about the altar which was made. 27 At noon, Elijah mocked them, and said, “Cry aloud; for he is a god. Either he is deep in thought, or he has gone somewhere, or he is on a journey, or perhaps he sleeps and must be awakened.”<br><br>28 They cried aloud, and cut themselves in their way with knives and lances, until the blood gushed out on them. 29 When midday was past, they prophesied until the time of the evening offering; but there was no voice, no answer, and nobody paid attention.<br><br>30 Elijah said to all the people, “Come near to me!”; and all the people came near to him. He repaired Yahweh’s altar that had been thrown down. 31 Elijah took twelve stones, according to the number of the tribes of the sons of Jacob, to whom Yahweh’s word came, saying, “Israel shall be your name.” 32 With the stones he built an altar in Yahweh’s name. He made a trench around the altar, large enough to contain two seahs[a] of seed. 33 He put the wood in order, and cut the bull in pieces, and laid it on the wood. He said, “Fill four jars with water, and pour it on the burnt offering, and on the wood.” 34 He said, “Do it a second time;” and they did it the second time. He said, “Do it a third time;” and they did it the third time. 35 The water ran around the altar; and he also filled the trench with water.<br><br>36 At the time of the evening offering, Elijah the prophet came near, and said, “Yahweh, the God of Abraham, of Isaac, and of Israel, let it be known today that you are God in Israel, and that I am your servant, and that I have done all these things at your word. 37 Hear me, Yahweh, hear me, that this people may know that you, Yahweh, are God, and that you have turned their heart back again.”<br><br>38 Then Yahweh’s fire fell, and consumed the burnt offering, the wood, the stones, and the dust, and licked up the water that was in the trench. 39 When all the people saw it, they fell on their faces. They said, “Yahweh, he is God! Yahweh, he is God!”<br><br>40 Elijah said to them, “Seize the prophets of Baal! Don’t let one of them escape!”<br><br>They seized them; and Elijah brought them down to the brook Kishon, and killed them there. 41 Elijah said to Ahab, “Get up, eat and drink; for there is the sound of abundance of rain.”<br><br>42 So Ahab went up to eat and to drink. Elijah went up to the top of Carmel; and he bowed himself down on the earth, and put his face between his knees. 43 He said to his servant, “Go up now, and look toward the sea.”<br><br>He went up, and looked, and said, “There is nothing.”<br><br>He said, “Go again” seven times.<br><br>44 On the seventh time, he said, “Behold, a small cloud, like a man’s hand, is rising out of the sea.”<br><br>He said, “Go up, tell Ahab, ‘Get ready and go down, so that the rain doesn’t stop you.’”</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/02_FB_ISC_Kings_Queens_1024.png", "iconSize": [27.900439238653, 48], "lat": 32.557853, "line": true, "lon": 35.327953, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Elijah sent his servant to King Ahab to tell him the rain was coming. The people had repented and turned back to God and the Lord blessed them with rain and food once more. (Acts 3:19).\"", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Elijah_Prophets_Baal/overview-images/045-elijah-prophets-baal.jpg?1643121027"}, "text": {"headline": "Ahab gets drenched", "text": "<span>Jezreel (19 miles from Mount Carmel)<br><br><b>1 Kings 18:45-46</b><br>45 In a little while, the sky grew black with clouds and wind, and there was a great rain. Ahab rode, and went to Jezreel. 46 Yahweh’s hand was on Elijah; and he tucked his cloak into his belt and ran before Ahab to the entrance of Jezreel.</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/20_FB_ISC_Kings_Queens_1024.png", "iconSize": [48, 37.99556541019955], "lat": 31.244722, "line": true, "lon": 34.840833, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Queen Jezebel was a very wicked woman, cruel and selfish, and she was powerful too. King Ahab ruled Israel, but Queen Jezebel ruled the king.\"", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Moody_Ahab/overview-images/016-moody-ahab.jpg?1643121097"}, "text": {"headline": "Elijah is afraid of Jezebel", "text": "<span>Beersheba (95 miles from Jezreel)<br><br><b>1 Kings 19:1-7</b><br>Ahab told Jezebel all that Elijah had done, and how he had killed all the prophets with the sword. 2 Then Jezebel sent a messenger to Elijah, saying, “So let the gods do to me, and more also, if I don’t make your life as the life of one of them by tomorrow about this time!”<br><br>3 When he saw that, he arose, and ran for his life, and came to Beersheba, which belongs to Judah, and left his servant there. 4 But he himself went a day’s journey into the wilderness, and came and sat down under a juniper tree. Then he requested for himself that he might die, and said, “It is enough. Now, O Yahweh, take away my life; for I am not better than my fathers.”<br><br>5 He lay down and slept under a juniper tree; and behold, an angel touched him, and said to him, “Arise and eat!”<br><br>6 He looked, and behold, there was at his head a cake baked on the coals, and a jar of water. He ate and drank, and lay down again. 7 Yahweh’s angel came again the second time, and touched him, and said, “Arise and eat, because the journey is too great for you.”</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/05_FB_ISC_Men_1_1024.png", "iconSize": [48, 47.270718232044196], "lat": 28.539722, "line": true, "lon": 33.973333, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "The monastery of St. Catherine at Mount Sinai", "credit": "https://www.bibleplaces.com/free/", "url": "https://www.bibleplaces.com/wp-content/uploads/2015/08/St-Catherines-Monastery-with-Jebel-Musa-tb062205290-1.jpg"}, "text": {"headline": "A still small voice in Mount Horeb (aka Mount Sinai)", "text": "<span>Mount Sinai (194 miles from Beersheba)<br><br><b>1 Kings 19:8-14</b><br>8 He arose, and ate and drank, and went in the strength of that food forty days and forty nights to Horeb, God’s Mountain. 9 He came to a cave there, and camped there; and behold, Yahweh’s word came to him, and he said to him, “What are you doing here, Elijah?”<br><br>10 He said, “I have been very jealous for Yahweh, the God of Armies; for the children of Israel have forsaken your covenant, thrown down your altars, and killed your prophets with the sword. I, even I only, am left; and they seek my life, to take it away.”<br><br>11 He said, “Go out, and stand on the mountain before Yahweh.”<br><br>Behold, Yahweh passed by, and a great and strong wind tore the mountains, and broke in pieces the rocks before Yahweh; but Yahweh was not in the wind. After the wind there was an earthquake; but Yahweh was not in the earthquake. 12 After the earthquake a fire passed; but Yahweh was not in the fire. After the fire, there was a still small voice. 13 When Elijah heard it, he wrapped his face in his mantle, went out, and stood in the entrance of the cave. Behold, a voice came to him, and said, “What are you doing here, Elijah?”<br><br>14 He said, “I have been very jealous for Yahweh, the God of Armies; for the children of Israel have forsaken your covenant, thrown down your altars, and killed your prophets with the sword. I, even I only, am left; and they seek my life, to take it away.”</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/16_FB_ISC_Men_2_1024.png", "iconSize": [40.238297872340425, 48], "lat": 33.511112, "line": true, "lon": 36.30639, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Elijah found Elisha out in a field ploughing with twelve yoke of oxen.\"", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Elijah_Elisha/overview-images/002-elijah-elisha.jpg?1613595829"}, "text": {"headline": "Elijah anoints Elisha", "text": "<span>Damascus (370 miles from Mount Sinai)<br><br><b>1 Kings 19:15-21</b><br>15 Yahweh said to him, “Go, return on your way to the wilderness of Damascus. When you arrive, anoint Hazael to be king over Syria. 16 Anoint Jehu the son of Nimshi to be king over Israel; and anoint Elisha the son of Shaphat of Abel Meholah to be prophet in your place. 17 He who escapes from the sword of Hazael, Jehu will kill; and he who escapes from the sword of Jehu, Elisha will kill. 18 Yet I reserved seven thousand in Israel, all the knees of which have not bowed to Baal, and every mouth which has not kissed him.”<br><br>19 So he departed from there, and found Elisha the son of Shaphat, who was plowing with twelve yoke of oxen before him, and he with the twelfth. Elijah went over to him, and put his mantle on him. 20 Elisha left the oxen, and ran after Elijah, and said, “Let me please kiss my father and my mother, and then I will follow you.”<br><br>He said to him, “Go back again; for what have I done to you?”<br><br>21 He returned from following him, and took the yoke of oxen, and killed them, and boiled their meat with the instruments of the oxen, and gave to the people, and they ate. Then he arose, and went after Elijah, and served him.</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/02_FB_ISC_Kings_Queens_1024.png", "iconSize": [27.900439238653, 48], "lat": 32.276111, "line": true, "lon": 35.195, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "Ben Hadad, king of Syria, besieged Samaria.", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Elisha_Siege/overview-images/001-elisha-siege.jpg?1613596061"}, "text": {"headline": "Ahab listens to prophet; first victory", "text": "<span>Samaria (107 miles from Damascus)<br><br><b>1 Kings 20:1-25</b><br>Ben Hadad the king of Syria gathered all his army together; and there were thirty-two kings with him, with horses and chariots. He went up and besieged Samaria, and fought against it. 2 He sent messengers to Ahab king of Israel, into the city, and said to him, “Ben Hadad says, 3 ‘Your silver and your gold is mine. Your wives also and your children, even the best, are mine.’”<br><br>4 The king of Israel answered, “It is according to your saying, my lord, O king. I am yours, and all that I have.”<br><br>5 The messengers came again, and said, “Ben Hadad says, ‘I sent indeed to you, saying, “You shall deliver me your silver, and your gold, and your wives, and your children; 6 but I will send my servants to you tomorrow about this time, and they will search your house, and the houses of your servants; whatever is pleasant in your eyes, they will put it in their hand, and take it away.”’”<br><br>7 Then the king of Israel called all the elders of the land, and said, “Please notice how this man seeks mischief; for he sent to me for my wives, and for my children, and for my silver, and for my gold; and I didn’t deny him.”<br><br>8 All the elders and all the people said to him, “Don’t listen, and don’t consent.”<br><br>9 Therefore he said to the messengers of Ben Hadad, “Tell my lord the king, ‘All that you sent for to your servant at the first I will do; but this thing I cannot do.’”<br><br>The messengers departed, and brought him back the message. 10 Ben Hadad sent to him, and said, “The gods do so to me, and more also, if the dust of Samaria will be enough for handfuls for all the people who follow me.”<br><br>11 The king of Israel answered, “Tell him, ‘Don’t let him who puts on his armor brag like he who takes it off.’”<br><br>12 When Ben Hadad heard this message, as he was drinking, he and the kings, in the pavilions, he said to his servants, “Prepare to attack!” So they prepared to attack the city.<br><br>13 Behold, a prophet came near to Ahab king of Israel, and said, “Yahweh says, ‘Have you seen all this great multitude? Behold, I will deliver it into your hand today. Then you will know that I am Yahweh.’”<br><br>14 Ahab said, “By whom?”<br><br>He said, “Yahweh says, ‘By the young men of the princes of the provinces.’”<br><br>Then he said, “Who shall begin the battle?”<br><br>He answered, “You.”<br><br>15 Then he mustered the young men of the princes of the provinces, and they were two hundred and thirty-two. After them, he mustered all the people, even all the children of Israel, being seven thousand. 16 They went out at noon. But Ben Hadad was drinking himself drunk in the pavilions, he and the kings, the thirty-two kings who helped him. 17 The young men of the princes of the provinces went out first; and Ben Hadad sent out, and they told him, saying, “Men are coming out from Samaria.”<br><br>18 He said, “If they have come out for peace, take them alive; or if they have come out for war, take them alive.”<br><br>19 So these went out of the city, the young men of the princes of the provinces, and the army which followed them. 20 They each killed his man. The Syrians fled, and Israel pursued them. Ben Hadad the king of Syria escaped on a horse with horsemen. 21 The king of Israel went out, and struck the horses and chariots, and killed the Syrians with a great slaughter. 22 The prophet came near to the king of Israel, and said to him, “Go, strengthen yourself, and mark, and see what you do; for at the return of the year the king of Syria will come up against you.”<br><br>23 The servants of the king of Syria said to him, “Their god is a god of the hills; therefore they were stronger than we. But let’s fight against them in the plain, and surely we will be stronger than they. 24 Do this thing: take the kings away, every man out of his place, and put captains in their place. 25 Muster an army, like the army that you have lost, horse for horse, and chariot for chariot. We will fight against them in the plain, and surely we will be stronger than they are.”<br><br>He listened to their voice, and did so.</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/02_FB_ISC_Kings_Queens_1024.png", "iconSize": [27.900439238653, 48], "lat": 32.783679, "line": true, "lon": 35.63729, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "", "credit": "", "url": ""}, "text": {"headline": "Not just the God of the hills; Ahab's second \"victory\"", "text": "<span>Aphek (44 miles from Samaria)<br><br><b>1 Kings 20:26-42</b><br>26 At the return of the year, Ben Hadad mustered the Syrians, and went up to Aphek, to fight against Israel. 27 The children of Israel were mustered and given provisions, and went against them. The children of Israel encamped before them like two little flocks of young goats; but the Syrians filled the country. 28 A man of God came near and spoke to the king of Israel, and said, “Yahweh says, ‘Because the Syrians have said, “Yahweh is a god of the hills, but he is not a god of the valleys;” therefore I will deliver all this great multitude into your hand, and you shall know that I am Yahweh.’”<br><br>29 They encamped opposite each other for seven days. So it was, that in the seventh day the battle was joined; and the children of Israel killed one hundred thousand footmen of the Syrians in one day. 30 But the rest fled to Aphek, into the city; and the wall fell on twenty-seven thousand men who were left. Ben Hadad fled, and came into the city, into an inner room. 31 His servants said to him, “See now, we have heard that the kings of the house of Israel are merciful kings. Please let us put sackcloth on our bodies, and ropes on our heads, and go out to the king of Israel. Maybe he will save your life.”<br><br>32 So they put sackcloth on their bodies and ropes on their heads, and came to the king of Israel, and said, “Your servant Ben Hadad says, ‘Please let me live.’”<br><br>He said, “Is he still alive? He is my brother.”<br><br>33 Now the men observed diligently, and hurried to take this phrase; and they said, “Your brother Ben Hadad.”<br><br>Then he said, “Go, bring him.”<br><br>Then Ben Hadad came out to him; and he caused him to come up into the chariot. 34 Ben Hadad said to him, “The cities which my father took from your father I will restore. You shall make streets for yourself in Damascus, as my father made in Samaria.”<br><br>“I”, said Ahab, “will let you go with this covenant.” So he made a covenant with him, and let him go.<br><br>35 A certain man of the sons of the prophets said to his fellow by Yahweh’s word, “Please strike me!”<br><br>The man refused to strike him. 36 Then he said to him, “Because you have not obeyed Yahweh’s voice, behold, as soon as you have departed from me, a lion will kill you.” As soon as he had departed from him, a lion found him and killed him.<br><br>37 Then he found another man, and said, “Please strike me.”<br><br>The man struck him and wounded him. 38 So the prophet departed, and waited for the king by the way, and disguised himself with his headband over his eyes. 39 As the king passed by, he cried to the king; and he said, “Your servant went out into the middle of the battle; and behold, a man came over, and brought a man to me, and said, ‘Guard this man! If by any means he is missing, then your life shall be for his life, or else you shall pay a talent[a] of silver.’ 40 As your servant was busy here and there, he was gone.”<br><br>The king of Israel said to him, “So shall your judgment be. You yourself have decided it.”<br><br>41 He hurried, and took the headband away from his eyes; and the king of Israel recognized that he was one of the prophets. 42 He said to him, “Yahweh says, ‘Because you have let go out of your hand the man whom I had devoted to destruction, therefore your life will take the place of his life, and your people take the place of his people.’”</span><br>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/02_FB_ISC_Kings_Queens_1024.png", "iconSize": [27.900439238653, 48], "lat": 32.276111, "line": true, "lon": 35.195, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "Ahab the big baby.", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Moody_Ahab/overview-images/014-moody-ahab.jpg?1643121097"}, "text": {"headline": "Moody Ahab", "text": "<span>Samaria (44 miles from Aphek)<br><br><b>1 Kings 20:43</b><br>43 The king of Israel went to his house sullen and angry, and came to Samaria.</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/20_FB_ISC_Kings_Queens_1024.png", "iconSize": [48, 37.99556541019955], "lat": 32.557853, "line": true, "lon": 35.327953, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Ahab discovered to his cost what is written in the Bible, ‘The wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord’ (Romans 6:23).\"", "credit": "FreeBibleimages.org", "url": "https://media.freebibleimages.org/stories/FB_Moody_Ahab/overview-images/035-moody-ahab.jpg?1643121099"}, "text": {"headline": "\"Have you found me, my enemy?\"", "text": "<span>Jezreel (21 miles from Samaria)<br><br><b>1 Kings 21:1-29</b><br>After these things, Naboth the Jezreelite had a vineyard, which was in Jezreel, next to the palace of Ahab king of Samaria. 2 Ahab spoke to Naboth, saying, “Give me your vineyard, that I may have it for a garden of herbs, because it is near my house; and I will give you for it a better vineyard than it. Or, if it seems good to you, I will give you its worth in money.”<br><br>3 Naboth said to Ahab, “May Yahweh forbid me, that I should give the inheritance of my fathers to you!”<br><br>4 Ahab came into his house sullen and angry because of the word which Naboth the Jezreelite had spoken to him; for he had said, “I will not give you the inheritance of my fathers.” He laid himself down on his bed, and turned away his face, and would eat no bread. 5 But Jezebel his wife came to him, and said to him, “Why is your spirit so sad, that you eat no bread?”<br><br>6 He said to her, “Because I spoke to Naboth the Jezreelite, and said to him, ‘Give me your vineyard for money; or else, if it pleases you, I will give you another vineyard for it.’ He answered, ‘I will not give you my vineyard.’”<br><br>7 Jezebel his wife said to him, “Do you now govern the kingdom of Israel? Arise, and eat bread, and let your heart be merry. I will give you the vineyard of Naboth the Jezreelite.” 8 So she wrote letters in Ahab’s name, and sealed them with his seal, and sent the letters to the elders and to the nobles who were in his city, who lived with Naboth. 9 She wrote in the letters, saying, “Proclaim a fast, and set Naboth on high among the people. 10 Set two men, wicked fellows, before him, and let them testify against him, saying, ‘You cursed God and the king!’ Then carry him out, and stone him to death.”<br><br>11 The men of his city, even the elders and the nobles who lived in his city, did as Jezebel had instructed them in the letters which she had written and sent to them. 12 They proclaimed a fast, and set Naboth on high among the people. 13 The two men, the wicked fellows, came in and sat before him. The wicked fellows testified against him, even against Naboth, in the presence of the people, saying, “Naboth cursed God and the king!” Then they carried him out of the city and stoned him to death with stones. 14 Then they sent to Jezebel, saying, “Naboth has been stoned, and is dead.”<br><br>15 When Jezebel heard that Naboth had been stoned, and was dead, Jezebel said to Ahab, “Arise, take possession of the vineyard of Naboth the Jezreelite, which he refused to give you for money; for Naboth is not alive, but dead.”<br><br>16 When Ahab heard that Naboth was dead, Ahab rose up to go down to the vineyard of Naboth the Jezreelite, to take possession of it.<br><br>17 Yahweh’s word came to Elijah the Tishbite, saying, 18 “Arise, go down to meet Ahab king of Israel, who dwells in Samaria. Behold, he is in the vineyard of Naboth, where he has gone down to take possession of it. 19 You shall speak to him, saying, ‘Yahweh says, “Have you killed and also taken possession?”’ You shall speak to him, saying, ‘Yahweh says, “In the place where dogs licked the blood of Naboth, dogs will lick your blood, even yours.”’”<br><br>20 Ahab said to Elijah, “Have you found me, my enemy?”<br><br>He answered, “I have found you, because you have sold yourself to do that which is evil in Yahweh’s sight. 21 Behold, I will bring evil on you, and will utterly sweep you away and will cut off from Ahab everyone who urinates against a wall,[a] and him who is shut up and him who is left at large in Israel. 22 I will make your house like the house of Jeroboam the son of Nebat, and like the house of Baasha the son of Ahijah for the provocation with which you have provoked me to anger, and have made Israel to sin.” 23 Yahweh also spoke of Jezebel, saying, “The dogs will eat Jezebel by the rampart of Jezreel. 24 The dogs will eat he who dies of Ahab in the city; and the birds of the sky will eat he who dies in the field.”<br><br>25 But there was no one like Ahab, who sold himself to do that which was evil in Yahweh’s sight, whom Jezebel his wife stirred up. 26 He did very abominably in following idols, according to all that the Amorites did, whom Yahweh cast out before the children of Israel. 27 When Ahab heard those words, he tore his clothes, and put sackcloth on his flesh, and fasted, and lay in sackcloth, and went softly.<br><br>28 Yahweh’s word came to Elijah the Tishbite, saying, 29 “See how Ahab humbles himself before me? Because he humbles himself before me, I will not bring the evil in his days; but I will bring the evil on his house in his son’s day.”</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/01_FB_ISC_Men_1_1024.png", "iconSize": [37.25874125874126, 48], "lat": 32.276111, "line": true, "lon": 35.195, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Micaiah's prophecy.\"", "credit": "Johann Christoph Weigel, Public domain, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Micaiah%27s_prophecy.jpg"}, "text": {"headline": "Micaiah, the truthful prophet", "text": "<span>Samaria (21 miles from Jezreel)<br><br><b>1 Kings 22:1-28</b><br>They continued three years without war between Syria and Israel. 2 In the third year, Jehoshaphat the king of Judah came down to the king of Israel. 3 The king of Israel said to his servants, “You know that Ramoth Gilead is ours, and we do nothing, and don’t take it out of the hand of the king of Syria?” 4 He said to Jehoshaphat, “Will you go with me to battle to Ramoth Gilead?”<br><br>Jehoshaphat said to the king of Israel, “I am as you are, my people as your people, my horses as your horses.” 5 Jehoshaphat said to the king of Israel, “Please inquire first for Yahweh’s word.”<br><br>6 Then the king of Israel gathered the prophets together, about four hundred men, and said to them, “Should I go against Ramoth Gilead to battle, or should I refrain?”<br><br>They said, “Go up; for the Lord will deliver it into the hand of the king.”<br><br>7 But Jehoshaphat said, “Isn’t there here a prophet of Yahweh, that we may inquire of him?”<br><br>8 The king of Israel said to Jehoshaphat, “There is yet one man by whom we may inquire of Yahweh, Micaiah the son of Imlah; but I hate him, for he does not prophesy good concerning me, but evil.”<br><br>Jehoshaphat said, “Don’t let the king say so.”<br><br>9 Then the king of Israel called an officer, and said, “Quickly get Micaiah the son of Imlah.”<br><br>10 Now the king of Israel and Jehoshaphat the king of Judah were sitting each on his throne, arrayed in their robes, in an open place at the entrance of the gate of Samaria; and all the prophets were prophesying before them. 11 Zedekiah the son of Chenaanah made himself horns of iron, and said, “Yahweh says, ‘With these you will push the Syrians, until they are consumed.’” 12 All the prophets prophesied so, saying, “Go up to Ramoth Gilead, and prosper; for Yahweh will deliver it into the hand of the king.”<br><br>13 The messenger who went to call Micaiah spoke to him, saying, “See now, the prophets declare good to the king with one mouth. Please let your word be like the word of one of them, and speak good.”<br><br>14 Micaiah said, “As Yahweh lives, what Yahweh says to me, that I will speak.”<br><br>15 When he had come to the king, the king said to him, “Micaiah, shall we go to Ramoth Gilead to battle, or shall we forbear?”<br><br>He answered him, “Go up and prosper; and Yahweh will deliver it into the hand of the king.” 16 The king said to him, “How many times do I have to adjure you that you speak to me nothing but the truth in Yahweh’s name?”<br><br>17 He said, “I saw all Israel scattered on the mountains, as sheep that have no shepherd. Yahweh said, ‘These have no master. Let them each return to his house in peace.’”<br><br>18 The king of Israel said to Jehoshaphat, “Didn’t I tell you that he would not prophesy good concerning me, but evil?”<br><br>19 Micaiah said, “Therefore hear Yahweh’s word. I saw Yahweh sitting on his throne, and all the army of heaven standing by him on his right hand and on his left. 20 Yahweh said, ‘Who will entice Ahab, that he may go up and fall at Ramoth Gilead?’ One said one thing; and another said another.<br><br>21 A spirit came out and stood before Yahweh, and said, ‘I will entice him.’<br><br>22 Yahweh said to him, ‘How?’<br><br>He said, ‘I will go out and will be a lying spirit in the mouth of all his prophets.’<br><br>He said, ‘You will entice him, and will also prevail. Go out and do so.’ 23 Now therefore, behold, Yahweh has put a lying spirit in the mouth of all these your prophets; and Yahweh has spoken evil concerning you.”<br><br>24 Then Zedekiah the son of Chenaanah came near, and struck Micaiah on the cheek, and said, “Which way did Yahweh’s Spirit go from me to speak to you?”<br><br>25 Micaiah said, “Behold, you will see on that day, when you go into an inner room to hide yourself.”<br><br>26 The king of Israel said, “Take Micaiah, and carry him back to Amon the governor of the city, and to Joash the king’s son. 27 Say, ‘The king says, “Put this fellow in the prison, and feed him with bread of affliction and with water of affliction, until I come in peace.”’”<br><br>28 Micaiah said, “If you return at all in peace, Yahweh has not spoken by me.” He said, “Listen, all you people!”</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/02_FB_ISC_Kings_Queens_1024.png", "iconSize": [27.900439238653, 48], "lat": 32.499852, "line": true, "lon": 36.014988, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"The death of Ahab.\"", "credit": "Gustave Doré, Public domain, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/5/52/093.The_Death_of_Ahab.jpg"}, "text": {"headline": "Ahad dies in battle", "text": "<span>Ramoth Gilead (50 miles from Samaria)<br><br><b>1 Kings 22:29-36</b><br>29 So the king of Israel and Jehoshaphat the king of Judah went up to Ramoth Gilead. 30 The king of Israel said to Jehoshaphat, “I will disguise myself, and go into the battle; but you put on your robes.” The king of Israel disguised himself, and went into the battle.<br><br>31 Now the king of Syria had commanded the thirty-two captains of his chariots, saying, “Don’t fight with small nor great, except only with the king of Israel.”<br><br>32 When the captains of the chariots saw Jehoshaphat, they said, “Surely that is the king of Israel!” and they came over to fight against him. Jehoshaphat cried out. 33 When the captains of the chariots saw that it was not the king of Israel, they turned back from pursuing him. 34 A certain man drew his bow at random, and struck the king of Israel between the joints of the armor. Therefore he said to the driver of his chariot, “Turn your hand, and carry me out of the battle; for I am severely wounded.” 35 The battle increased that day. The king was propped up in his chariot facing the Syrians, and died at evening. The blood ran out of the wound into the bottom of the chariot. 36 A cry went throughout the army about the going down of the sun, saying, “Every man to his city, and every man to his country!”</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/04_FB_ISC_Kings_Queens_1024.png", "iconSize": [43.02481751824818, 48], "lat": 32.276111, "line": true, "lon": 35.195, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Elijah destroys the messengers of Ahaziah.\"", "credit": "Gustave Doré, Public domain, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/d/d1/094.Elijah_Destroys_the_Messengers_of_Ahaziah.jpg"}, "text": {"headline": "Like father like son", "text": "<span>Samaria (50 miles from Ramoth Gilead)<br><br><b>1 Kings 22:37-53</b><br>37 So the king died, and was brought to Samaria; and they buried the king in Samaria. 38 They washed the chariot by the pool of Samaria; and the dogs licked up his blood where the prostitutes washed themselves; according to Yahweh’s word which he spoke.<br><br>39 Now the rest of the acts of Ahab, and all that he did, and the ivory house which he built, and all the cities that he built, aren’t they written in the book of the chronicles of the kings of Israel? 40 So Ahab slept with his fathers; and Ahaziah his son reigned in his place.<br><br>41 Jehoshaphat the son of Asa began to reign over Judah in the fourth year of Ahab king of Israel. 42 Jehoshaphat was thirty-five years old when he began to reign; and he reigned twenty-five years in Jerusalem. His mother’s name was Azubah the daughter of Shilhi. 43 He walked in all the way of Asa his father. He didn’t turn away from it, doing that which was right in Yahweh’s eyes. However the high places were not taken away. The people still sacrificed and burned incense on the high places. 44 Jehoshaphat made peace with the king of Israel. 45 Now the rest of the acts of Jehoshaphat, and his might that he showed, and how he fought, aren’t they written in the book of the chronicles of the kings of Judah? 46 The remnant of the sodomites, that remained in the days of his father Asa, he put away out of the land. 47 There was no king in Edom. A deputy ruled. 48 Jehoshaphat made ships of Tarshish to go to Ophir for gold, but they didn’t go; for the ships wrecked at Ezion Geber. 49 Then Ahaziah the son of Ahab said to Jehoshaphat, “Let my servants go with your servants in the ships.” But Jehoshaphat would not. 50 Jehoshaphat slept with his fathers, and was buried with his fathers in his father David’s city. Jehoram his son reigned in his place.<br><br>51 Ahaziah the son of Ahab began to reign over Israel in Samaria in the seventeenth year of Jehoshaphat king of Judah, and he reigned two years over Israel. 52 He did that which was evil in Yahweh’s sight, and walked in the way of his father, and in the way of his mother, and in the way of Jeroboam the son of Nebat, in which he made Israel to sin. 53 He served Baal and worshiped him, and provoked Yahweh, the God of Israel, to anger in all the ways that his father had done so.<br><br><b>2 Kings 1:1-18</b><br>Moab rebelled against Israel after the death of Ahab. 2 Ahaziah fell down through the lattice in his upper room that was in Samaria, and was sick. So he sent messengers, and said to them, “Go, inquire of Baal Zebub, the god of Ekron, whether I will recover of this sickness.”<br><br>3 But Yahweh’s[a] angel said to Elijah the Tishbite, “Arise, go up to meet the messengers of the king of Samaria, and tell them, ‘Is it because there is no God[b] in Israel, that you go to inquire of Baal Zebub, the god of Ekron? 4 Now therefore Yahweh says, “You will not come down from the bed where you have gone up, but you will surely die.”’” Then Elijah departed.<br><br>5 The messengers returned to him, and he said to them, “Why is it that you have returned?”<br><br>6 They said to him, “A man came up to meet us, and said to us, ‘Go, return to the king who sent you, and tell him, “Yahweh says, ‘Is it because there is no God in Israel, that you send to inquire of Baal Zebub, the god of Ekron? Therefore you will not come down from the bed where you have gone up, but you will surely die.’”’”<br><br>7 He said to them, “What kind of man was he who came up to meet you, and told you these words?”<br><br>8 They answered him, “He was a hairy man, and wearing a leather belt around his waist.”<br><br>He said, “It’s Elijah the Tishbite.”<br><br>9 Then the king sent a captain of fifty with his fifty to him. He went up to him; and behold,[c] he was sitting on the top of the hill. He said to him, “Man of God, the king has said, ‘Come down!’”<br><br>10 Elijah answered to the captain of fifty, “If I am a man of God, then let fire come down from the sky, and consume you and your fifty!” Then fire came down from the sky, and consumed him and his fifty.<br><br>11 Again he sent to him another captain of fifty with his fifty. He answered him, “Man of God, the king has said, ‘Come down quickly!’”<br><br>12 Elijah answered them, “If I am a man of God, then let fire come down from the sky, and consume you and your fifty!” Then God’s fire came down from the sky, and consumed him and his fifty.<br><br>13 Again he sent the captain of a third fifty with his fifty. The third captain of fifty went up, and came and fell on his knees before Elijah, and begged him, and said to him, “Man of God, please let my life, and the life of these fifty of your servants, be precious in your sight. 14 Behold, fire came down from the sky, and consumed the last two captains of fifty with their fifties. But now let my life be precious in your sight.”<br><br>15 Yahweh’s angel said to Elijah, “Go down with him. Don’t be afraid of him.”<br><br>Then he arose, and went down with him to the king. 16 He said to him, “Yahweh says, ‘Because you have sent messengers to inquire of Baal Zebub, the god of Ekron, is it because there is no God in Israel to inquire of his word? Therefore you will not come down from the bed where you have gone up, but you will surely die.’”<br><br>17 So he died according to Yahweh’s word which Elijah had spoken. Jehoram began to reign in his place in the second year of Jehoram the son of Jehoshaphat king of Judah, because he had no son. 18 Now the rest of the acts of Ahaziah which he did, aren’t they written in the book of the chronicles of the kings of Israel?</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/Elisha & Elijah.png", "iconSize": [48, 28.8], "lat": 32.030556, "line": true, "lon": 35.225, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "Gilgal means \"circle\" probably referring to a circular altar (source: Holman Illustrated Bible Dictionary, 2015).", "credit": "Bukvoed, CC BY 4.0 <https://creativecommons.org/licenses/by/4.0>, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/0/01/Gilgal-Argaman-691.jpg"}, "text": {"headline": "Gilgal - where God makes you a new person", "text": "<span>Gilgal (17 miles from Samaria)<br><br><b>2 Kings 2:1</b><br>When Yahweh was about to take Elijah up by a whirlwind into heaven, Elijah went with Elisha from Gilgal.</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/Elisha & Elijah.png", "iconSize": [48, 28.8], "lat": 31.922778, "line": true, "lon": 35.241389, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"Joshua passing the river Jordan with the ark of the covenant.\" Bethel means \"house of God\"; the ark of the covenant was kept in Bethel early in the period of the judges (source: Holman Illustrated Bible Dictionary, 2015).", "credit": "Benjamin West, Public domain, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/2/20/Benjamin_West_-_Joshua_passing_the_River_Jordan_with_the_Ark_of_the_Covenant_-_Google_Art_Project.jpg"}, "text": {"headline": "Bethel - place of worship and surrender", "text": "<span>Bethel (8 miles from Gilgal)<br><br><b>2 Kings 2:2-3</b><br>2 Elijah said to Elisha, “Please wait here, for Yahweh has sent me as far as Bethel.”<br><br>Elisha said, “As Yahweh lives, and as your soul lives, I will not leave you.” So they went down to Bethel.<br><br>3 The sons of the prophets who were at Bethel came out to Elisha, and said to him, “Do you know that Yahweh will take away your master from your head today?”<br><br>He said, “Yes, I know it. Hold your peace.”</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/Elisha & Elijah.png", "iconSize": [48, 28.8], "lat": 31.871719, "line": true, "lon": 35.444564, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "Jericho, an oasis in north-eastern part of the Judaean Desert.", "credit": "CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Jerycho_widok_z_Gory_Kuszenia_%282%29.jpg"}, "text": {"headline": "Jericho - where you fight", "text": "<span>Jericho (12 miles from Bethel)<br><br><b>2 Kings 2:4-5</b><br>4 Elijah said to him, “Elisha, please wait here, for Yahweh has sent me to Jericho.”<br><br>He said, “As Yahweh lives, and as your soul lives, I will not leave you.” So they came to Jericho.<br><br>5 The sons of the prophets who were at Jericho came near to Elisha, and said to him, “Do you know that Yahweh will take away your master from your head today?”<br><br>He answered, “Yes, I know it. Hold your peace.”</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/Elisha & Elijah.png", "iconSize": [48, 28.8], "lat": 31.761389, "line": true, "lon": 35.558333, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "\"The ascension of Elijah. Landscape in which the prophet Elisha sees Elijah riding to heaven in the fiery chariot.\"", "credit": "David Colijns, CC0, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/8/86/De_hemelvaart_van_Elia_Rijksmuseum_SK-A-1617.jpeg"}, "text": {"headline": "Elijah's ascension", "text": "<span>Jordan river (10 miles from Jericho)<br><br><b>2 Kings 2:6-17</b><br>6 Elijah said to him, “Please wait here, for Yahweh has sent me to the Jordan.”<br><br>He said, “As Yahweh lives, and as your soul lives, I will not leave you.” Then they both went on. 7 Fifty men of the sons of the prophets went, and stood opposite them at a distance; and they both stood by the Jordan. 8 Elijah took his mantle, and rolled it up, and struck the waters, and they were divided here and there, so that they both went over on dry ground. 9 When they had gone over, Elijah said to Elisha, “Ask what I shall do for you, before I am taken from you.”<br><br>Elisha said, “Please let a double portion of your spirit be on me.”<br><br>10 He said, “You have asked a hard thing. If you see me when I am taken from you, it will be so for you; but if not, it will not be so.”<br><br>11 As they continued on and talked, behold, a chariot of fire and horses of fire separated them, and Elijah went up by a whirlwind into heaven. 12 Elisha saw it, and he cried, “My father, my father, the chariots of Israel and its horsemen!”<br><br>He saw him no more. Then he took hold of his own clothes, and tore them in two pieces. 13 He also took up Elijah’s mantle that fell from him, and went back, and stood by the bank of the Jordan. 14 He took Elijah’s mantle that fell from him, and struck the waters, and said, “Where is Yahweh, the God of Elijah?” When he also had struck the waters, they were divided apart, and Elisha went over. 15 When the sons of the prophets who were at Jericho facing him saw him, they said, “The spirit of Elijah rests on Elisha.” They came to meet him, and bowed themselves to the ground before him. 16 They said to him, “See now, there are with your servants fifty strong men. Please let them go and seek your master. Perhaps Yahweh’s Spirit has taken him up, and put him on some mountain, or into some valley.”<br><br>He said, “Don’t send them.”<br><br>17 When they urged him until he was ashamed, he said, “Send them.”<br><br>Therefore they sent fifty men; and they searched for three days, but didn’t find him.</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/16_FB_ISC_Men_2_1024.png", "iconSize": [40.238297872340425, 48], "lat": 31.871719, "line": true, "lon": 35.444564, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "", "credit": "", "url": ""}, "text": {"headline": "The healing Salt", "text": "<span>Jericho (10 miles from Jordan river)<br><br><b>2 Kings 2:18-22</b><br>18 They came back to him, while he stayed at Jericho; and he said to them, “Didn’t I tell you, ‘Don’t go?’”<br><br>19 The men of the city said to Elisha, “Behold, please, the situation of this city is pleasant, as my lord sees; but the water is bad, and the land is barren.”<br><br>20 He said, “Bring me a new jar, and put salt in it.” Then they brought it to him. 21 He went out to the spring of the waters, and threw salt into it, and said, “Yahweh says, ‘I have healed these waters. There shall not be from there any more death or barren wasteland.’” 22 So the waters were healed to this day, according to Elisha’s word which he spoke.</span>"}}, {"date": "", "location": {"icon": "//uploads.knightlab.com/storymapjs/cd9a2b6c7eda90f59f8a7b5210906da8/elijah-elisha/_images/16_FB_ISC_Men_2_1024.png", "iconSize": [40.238297872340425, 48], "lat": 31.922778, "line": true, "lon": 35.241389, "use_custom_marker": true, "zoom": 12}, "media": {"caption": "", "credit": "Internet Archive Book Images, No restrictions, via Wikimedia Commons", "url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/The_Bible_panorama%2C_or_The_Holy_Scriptures_in_picture_and_story_%281891%29_%2814781812371%29.jpg"}, "text": {"headline": "\"Mt. Baldy\" - Do not mock God's chosen", "text": "<span>Bethel (12 miles from Jericho)<br><br><b>2 Kings 2:23-25</b><br>23 He went up from there to Bethel. As he was going up by the way, some youths came out of the city and mocked him, and said to him, “Go up, you baldy! Go up, you baldy!” 24 He looked behind him and saw them, and cursed them in Yahweh’s name. Then two female bears came out of the woods, and mauled forty-two of those youths. 25 He went from there to Mount Carmel, and from there he returned to Samaria.</span>"}}], "zoomify": false}}